RT-Thread/rt-thread/bsp/freescale/platform/devices/MK22FA12/include/MK22FA12.h
/* FMC - Register instance definitions */
/* FMC */
#define FMC_PFAPR                                FMC_PFAPR_REG(FMC)
#define FMC_PFB0CR                               FMC_PFB0CR_REG(FMC)
#define FMC_PFB1CR                               FMC_PFB1CR_REG(FMC)
#define FMC_TAGVDW0S0                            FMC_TAGVDW0S_REG(FMC,0)
#define FMC_TAGVDW0S1                            FMC_TAGVDW0S_REG(FMC,1)
#define FMC_TAGVDW0S2                            FMC_TAGVDW0S_REG(FMC,2)
#define FMC_TAGVDW0S3                            FMC_TAGVDW0S_REG(FMC,3)
#define FMC_TAGVDW1S0                            FMC_TAGVDW1S_REG(FMC,0)
#define FMC_TAGVDW1S1                            FMC_TAGVDW1S_REG(FMC,1)
#define FMC_TAGVDW1S2                            FMC_TAGVDW1S_REG(FMC,2)
#define FMC_TAGVDW1S3                            FMC_TAGVDW1S_REG(FMC,3)
#define FMC_TAGVDW2S0                            FMC_TAGVDW2S_REG(FMC,0)
#define FMC_TAGVDW2S1                            FMC_TAGVDW2S_REG(FMC,1)
#define FMC_TAGVDW2S2                            FMC_TAGVDW2S_REG(FMC,2)
#define FMC_TAGVDW2S3                            FMC_TAGVDW2S_REG(FMC,3)
#define FMC_TAGVDW3S0                            FMC_TAGVDW3S_REG(FMC,0)
#define FMC_TAGVDW3S1                            FMC_TAGVDW3S_REG(FMC,1)
#define FMC_TAGVDW3S2                            FMC_TAGVDW3S_REG(FMC,2)
#define FMC_TAGVDW3S3                            FMC_TAGVDW3S_REG(FMC,3)
#define FMC_DATAW0S0UM                           FMC_DATA_UM_REG(FMC,0,0)
#define FMC_DATAW0S0MU                           FMC_DATA_MU_REG(FMC,0,0)
#define FMC_DATAW0S0ML                           FMC_DATA_ML_REG(FMC,0,0)
#define FMC_DATAW0S0LM                           FMC_DATA_LM_REG(FMC,0,0)
#define FMC_DATAW0S1UM                           FMC_DATA_UM_REG(FMC,0,1)
#define FMC_DATAW0S1MU                           FMC_DATA_MU_REG(FMC,0,1)
#define FMC_DATAW0S1ML                           FMC_DATA_ML_REG(FMC,0,1)
#define FMC_DATAW0S1LM                           FMC_DATA_LM_REG(FMC,0,1)
#define FMC_DATAW0S2UM                           FMC_DATA_UM_REG(FMC,0,2)
#define FMC_DATAW0S2MU                           FMC_DATA_MU_REG(FMC,0,2)
#define FMC_DATAW0S2ML                           FMC_DATA_ML_REG(FMC,0,2)
#define FMC_DATAW0S2LM                           FMC_DATA_LM_REG(FMC,0,2)
#define FMC_DATAW0S3UM                           FMC_DATA_UM_REG(FMC,0,3)
#define FMC_DATAW0S3MU                           FMC_DATA_MU_REG(FMC,0,3)
#define FMC_DATAW0S3ML                           FMC_DATA_ML_REG(FMC,0,3)
#define FMC_DATAW0S3LM                           FMC_DATA_LM_REG(FMC,0,3)
#define FMC_DATAW1S0UM                           FMC_DATA_UM_REG(FMC,1,0)
#define FMC_DATAW1S0MU                           FMC_DATA_MU_REG(FMC,1,0)
#define FMC_DATAW1S0ML                           FMC_DATA_ML_REG(FMC,1,0)
#define FMC_DATAW1S0LM                           FMC_DATA_LM_REG(FMC,1,0)
#define FMC_DATAW1S1UM                           FMC_DATA_UM_REG(FMC,1,1)
#define FMC_DATAW1S1MU                           FMC_DATA_MU_REG(FMC,1,1)
#define FMC_DATAW1S1ML                           FMC_DATA_ML_REG(FMC,1,1)
#define FMC_DATAW1S1LM                           FMC_DATA_LM_REG(FMC,1,1)
#define FMC_DATAW1S2UM                           FMC_DATA_UM_REG(FMC,1,2)
#define FMC_DATAW1S2MU                           FMC_DATA_MU_REG(FMC,1,2)
#define FMC_DATAW1S2ML                           FMC_DATA_ML_REG(FMC,1,2)
#define FMC_DATAW1S2LM                           FMC_DATA_LM_REG(FMC,1,2)
#define FMC_DATAW1S3UM                           FMC_DATA_UM_REG(FMC,1,3)
#define FMC_DATAW1S3MU                           FMC_DATA_MU_REG(FMC,1,3)
#define FMC_DATAW1S3ML                           FMC_DATA_ML_REG(FMC,1,3)
#define FMC_DATAW1S3LM                           FMC_DATA_LM_REG(FMC,1,3)
#define FMC_DATAW2S0UM                           FMC_DATA_UM_REG(FMC,2,0)
#define FMC_DATAW2S0MU                           FMC_DATA_MU_REG(FMC,2,0)
#define FMC_DATAW2S0ML                           FMC_DATA_ML_REG(FMC,2,0)
#define FMC_DATAW2S0LM                           FMC_DATA_LM_REG(FMC,2,0)
#define FMC_DATAW2S1UM                           FMC_DATA_UM_REG(FMC,2,1)
#define FMC_DATAW2S1MU                           FMC_DATA_MU_REG(FMC,2,1)
#define FMC_DATAW2S1ML                           FMC_DATA_ML_REG(FMC,2,1)
#define FMC_DATAW2S1LM                           FMC_DATA_LM_REG(FMC,2,1)
#define FMC_DATAW2S2UM                           FMC_DATA_UM_REG(FMC,2,2)
#define FMC_DATAW2S2MU                           FMC_DATA_MU_REG(FMC,2,2)
#define FMC_DATAW2S2ML                           FMC_DATA_ML_REG(FMC,2,2)
#define FMC_DATAW2S2LM                           FMC_DATA_LM_REG(FMC,2,2)
#define FMC_DATAW2S3UM                           FMC_DATA_UM_REG(FMC,2,3)
#define FMC_DATAW2S3MU                           FMC_DATA_MU_REG(FMC,2,3)
#define FMC_DATAW2S3ML                           FMC_DATA_ML_REG(FMC,2,3)
#define FMC_DATAW2S3LM                           FMC_DATA_LM_REG(FMC,2,3)
#define FMC_DATAW3S0UM                           FMC_DATA_UM_REG(FMC,3,0)
#define FMC_DATAW3S0MU                           FMC_DATA_MU_REG(FMC,3,0)
#define FMC_DATAW3S0ML                           FMC_DATA_ML_REG(FMC,3,0)
#define FMC_DATAW3S0LM                           FMC_DATA_LM_REG(FMC,3,0)
#define FMC_DATAW3S1UM                           FMC_DATA_UM_REG(FMC,3,1)
#define FMC_DATAW3S1MU                           FMC_DATA_MU_REG(FMC,3,1)
#define FMC_DATAW3S1ML                           FMC_DATA_ML_REG(FMC,3,1)
#define FMC_DATAW3S1LM                           FMC_DATA_LM_REG(FMC,3,1)
#define FMC_DATAW3S2UM                           FMC_DATA_UM_REG(FMC,3,2)
#define FMC_DATAW3S2MU                           FMC_DATA_MU_REG(FMC,3,2)
#define FMC_DATAW3S2ML                           FMC_DATA_ML_REG(FMC,3,2)
#define FMC_DATAW3S2LM                           FMC_DATA_LM_REG(FMC,3,2)
#define FMC_DATAW3S3UM                           FMC_DATA_UM_REG(FMC,3,3)
#define FMC_DATAW3S3MU                           FMC_DATA_MU_REG(FMC,3,3)
#define FMC_DATAW3S3ML                           FMC_DATA_ML_REG(FMC,3,3)
#define FMC_DATAW3S3LM                           FMC_DATA_LM_REG(FMC,3,3)

